

/*************  技术支持与购买说明    **************
产品主页：http://tw51.haohaodada.com
淘宝搜索：天问51，可购买。目前基础版99元，带彩屏标准备版149元
技术支持QQ群一：1138055784
******************************************/
#include "led8.h"

//========================================================================
// 描述: 使能LED.
// 参数: none.
// 返回: none.
//========================================================================
void led8_enable()
{
    LED8_CONTROL_MODE;//推挽输出
    LED8_CONTROL_PIN = 0;
}

//========================================================================
// 描述: 禁用LED.
// 参数: none.
// 返回: none.
//========================================================================
void led8_disable()
{
    LED8_CONTROL_MODE;//推挽输出
    LED8_CONTROL_PIN = 1;
}
