/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序        */
/*---------------------------------------------------------------------*/


/*************  功能说明    **************

单纯的IO口初始化，端口模式配置参考程序.

******************************************/

#include "reg51.h"       //包含此头文件后，里面声明的寄存器不需要再手动输入，避免重复定义
#include "intrins.h"

//手动输入声明"reg51.h"头文件里面没有定义的寄存器
sfr     P0M0        =   0x94;
sfr     P0M1        =   0x93;
sfr     P1M0        =   0x92;
sfr     P1M1        =   0x91;
sfr     P2M0        =   0x96;
sfr     P2M1        =   0x95;
sfr     P3M0        =   0xb2;
sfr     P3M1        =   0xb1;
sfr     P4M0        =   0xb4;
sfr     P4M1        =   0xb3;
sfr     P5M0        =   0xca;
sfr     P5M1        =   0xc9;
sfr     P6M0        =   0xcc;
sfr     P6M1        =   0xcb;
sfr     P7M0        =   0xe2;
sfr     P7M1        =   0xe1;

void main()
{
    P0M0 = 0x00;                                //设置P0.0~P0.7为双向口模式
    P0M1 = 0x00;

    P1M0 = 0xff;                                //设置P1.0~P1.7为推挽输出模式
    P1M1 = 0x00;
//    P1M0 = 0xf0;                                //设置P1.4~P1.7为推挽输出模式，设置P1.0~P0.3为双向口模式
//    P1M1 = 0x00;

    P2M0 = 0x00;                                //设置P2.0~P2.7为高阻输入模式
    P2M1 = 0xff;
//    P2M0 = 0x00;                                //设置P2.0~P2.3为高阻输入模式，设置P2.4~P2.7为双向口模式
//    P2M1 = 0x0f;

    P3M0 = 0xff;                                //设置P3.0~P3.7为开漏模式
    P3M1 = 0xff;
//    P3M0 = 0x0f;                                //设置P3.0~P3.3为开漏模式，设置P3.4~P3.7为高阻输入模式
//    P3M1 = 0xff;

    while (1);
}

